Repository: mishin/perldoc-ru
Catalog: pod2-ru/omegat/project_save.tmx
Source language: en_us
Languages: ru_ru

source: perlwin32 Perl notes for Windows
ru_ru: perlwin32 Perl заметки для Windows

source: perlxs Perl XS application programming interface
ru_ru: perlxs Perl XS интерфейс прикладного программирования

source: perlxstut Perl XS tutorial
ru_ru: perlxstut Perl XS учебник

source: perlxstypemap Perl XS C/Perl type conversion tools
ru_ru: perlxstypemap Perl XS C/Perl инструменты преобразования типов

source: print "Hello
ru_ru: print "Привет

# print "Hello, $name "; # works fine
source: print "Hello, $name\n"; # works fine
ru_ru: print "Hello, $name\n"; # работает отлично

source: print "Hello, world";
ru_ru: print "Привет, мир";

# print "LA LA LA " while 1; # loops forever
source: print "LA LA LA\n" while 1; # loops forever
ru_ru: print "LA LA LA\n" while 1; # зацикливается навсегда

# print "Scalars begin with a $variables->{'scalar'}->{'sigil'} ";
source: print "Scalars begin with a $variables->{'scalar'}->{'sigil'}\n";
ru_ru: print "Скаляры начинаются с $variables->{'scalar'}->{'sigil'}\n";

# print "The value of $key is $hash{$key} ";
source: print "The value of $key is $hash{$key}\n";
ru_ru: print "Значение $key есть $hash{$key}\n";

# print "This element is $_ ";
source: print "This element is $_\n";
ru_ru: print "Это элемент $_\n";

source: print $animals[0]; # prints "camel"
ru_ru: print $animals[0]; # печатает "camel"

source: print $animals[1]; # prints "llama"
ru_ru: print $animals[1]; # печатает "llama"

source: print $mixed[$#mixed]; # last element, prints 1.23
ru_ru: print $mixed[$#mixed]; # последний элемент, печатает 1.23

source: print $x; # prints "foo"
ru_ru: print $x; # печатает "foo"

source: print $y; # prints nothing; $y has fallen out of scope
ru_ru: print $y; # ничего не печатает; $y выпал из сферы видимости переменной

# print 'Hello, $name '; # prints $name literally
source: print 'Hello, $name\n'; # prints $name\n literally
ru_ru: print 'Hello, $name\n'; # печатает $name\n буквально

source: print 'Hello, world';
ru_ru: print 'Привет, мир';

source: print; # prints contents of $_ by default
ru_ru: print; # Выводит содержимое $_ по умолчанию

source: prints a summary of the options.
ru_ru: выдает список опций.

source: prints summary of the major perl configuration values and the current values of @INC.
ru_ru: выдает сводную таблицу основных значений конфигурации Perl и текущие значения @INC.

source: prints the version and patchlevel of your perl executable.
ru_ru: выдает номер версии и патч (patchlevel) вашего исполняемого perl файл.

source: prints warnings about dubious constructs, such as variable names mentioned only once and scalar variables used before being set; redefined subroutines; references to undefined filehandles; filehandles opened read-only that you are attempting to write on; values used as a number that don't I<look> like numbers; using an array as though it were a scalar; if your subroutines recurse more than 100 deep; and innumerable other things.
ru_ru: печать предупреждения о сомнительных конструкций, таких как имена переменных упоминается только один раз и скалярных переменных, используемых, прежде чем установить; пересмотрены подпрограмм; ссылки на неопределенные дескрипторов файлов дескрипторов файлов открыт только для чтения, который вы пытаетесь писать на; значения, используемые как число, которое вы не должны I<видеть> как числа; использованием массива, как если бы это был скалярного, если ваш подпрограммы имеют рекурсию глубиной более 100 вложений, и бесчисленное множество других вещей.

source: range operator (creates a list of numbers)
ru_ru: оператор диапазона (создает список чисел)

source: runs the program under the Perl debugger.
ru_ru: запускает программу под управлением отладчика Perl.

source: runs the program under the control of a debugging, profiling, or tracing module installed as C<Devel::I<MOD>>.
ru_ru: запускает программу под контроль отладки, профилирования, или отслеживание модуля, устанавливаемого как C<Devel::I<MOD>>.

source: s/foo/bar/; # replaces foo with bar in $_
ru_ru: s/foo/bar/; # заменяет foo с bar в $_

source: s2p sed to perl translator
ru_ru: s2p перевод sed в perl

source: set
ru_ru: набор

source: sets debugging flags.
ru_ru: устанавливает флаги отладки.

source: specifies that files processed by the C<E<lt>E<gt>> construct are to be edited in-place.
ru_ru: указывает, что файлы, обрабатываемые конструкцией C<E<lt>E<gt>> , будут отредактированы на месте (edited in-place).

source: specifies the input record separator (C<$/>) as an octal or hexadecimal number.
ru_ru: указывается разделитель входных записей ((C<$/>) как восьмеричное или шестнадцатеричное число.

source: specifies the names of the input fields if input does not have to be split into an array.
ru_ru: указывает имена полей ввода, если ввод не должен быть разделен на массив.

source: specifies the pattern to split on if B<-a> is also in effect.
ru_ru: указвывает шаблон для разделения, также можно использовать B<-a>.

source: string concatenation
ru_ru: конкатенации строк

source: tells Perl that the program is embedded in a larger chunk of unrelated text, such as in a mail message.
ru_ru: говорит Perl, что программа встраивается в большой кусок текста не связаны, например, в почтовом сообщении.

source: tells a2p that this awk script is always invoked with this B<-F> switch.
ru_ru: говорит a2p то этот сценарий AWK всегда вызывается с этой B<-F> опцией.

source: tells a2p to use old awk behavior.
ru_ru: вызовите a2p для использования старого поведения awk.

source: them conditional on the locale environment variables
ru_ru: они зависят от локальных переменных среды

source: to give the output
ru_ru: Результат выполнения кода:

source: to let Perl see the B<-p> switch.
ru_ru: позволяя Perl увидеть ключ B<-p>.

source: turns on "taint" so you can test them.
ru_ru: переключает в "клеймо" ("taint"), поэтому вы можете проверить их.

source: turns on autosplit mode when used with a B<-n> or B<-p>.
ru_ru: включает AutoSplit режим (режим авторазбиения), когда используется B<-n> или B<-p>.

source: unless ( condition ) {
ru_ru: unless ( условие ) {

source: unreleased use)
ru_ru: неизданного использования)

source: using -Ds)
ru_ru: использование -Ds)

source: which is equivalent to
ru_ru: что эквивалентно

source: while (<$in>) { # assigns each line in turn to $_
ru_ru: while (<$in>) { # присваивает каждой строке $_

source: while (<>) { ... # your program goes here
ru_ru: while (<>) { ... # ваша программа идет здесь

source: world";
ru_ru: мир";

source: x string multiplication
ru_ru: x умножение строк

source: zero or one of the previous thing
ru_ru: ноль или один от предыдущей вещи

source: {3,6} matches between 3 and 6 of the previous thing
ru_ru: {3,6} соответствует между 3 и 6 от предыдущей вещи

source: {3,} matches 3 or more of the previous thing
ru_ru: {3,} соответствует 3 или более от предыдущей вещи

source: {3} matches exactly 3 of the previous thing
ru_ru: {3} соответствует ровно 3 от предыдущей вещи

source: || or
ru_ru: || или

source: } elsif ( other condition ) {
ru_ru: } elsif ( другое условие ) {
